import json

data = [
    {"Год": 2010, "Процент": 24.8}, {"Год": 2011, "Процент": 24.6},
    {"Год": 2012, "Процент": 23.8}, {"Год": 2013, "Процент": 23.0},
    {"Год": 2014, "Процент": 22.6}, {"Год": 2015, "Процент": 21.6},
    {"Год": 2016, "Процент": 21.1}, {"Год": 2017, "Процент": 21.1},
    {"Год": 2018, "Процент": 21.2}, {"Год": 2019, "Процент": 21.0},
    {"Год": 2020, "Процент": 21.7}, {"Год": 2021, "Процент": 22.3},
    {"Год": 2022, "Процент": 22.4}, {"Год": 2023, "Процент": 23.1},
    {"Год": 2024, "Процент": 23.4}
]

with open('birth_data.json', 'w', encoding='utf-8') as f:
    json.dump(data, f, ensure_ascii=False, indent=2)

print("Файл birth_data.json успешно создан!")